Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes Constructor (ModelObject, String)
 Creates a straight dimension set attributes instance that loads the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimensionSetAttributes(
	ModelObject modelObject,
	string AttributesFile
)
Public Sub New (
	modelObject As ModelObject,
	AttributesFile As String
)
Parameters
modelObject
Type: Tekla.Structures.Drawing.ModelObject
The model object that the dimension set will be associated with.
AttributesFile
Type: System.String
The filename of the attributes file.
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
StraightDimensionSet.StraightDimensionSetAttributes Overload
Tekla.Structures.Drawing Namespace